In [9]:
import pandas as pd
import numpy as np

In [3]:
file_path = "/workspaces/demo-devcontainer/resource/data_with_nan.csv"
df = pd.read_csv(file_path)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [4]:
df["col1"][3]

nan

In [5]:
type(df["col1"][3])

float

In [6]:
df["col2"].mean()

np.float64(28.5)

In [8]:
df["col2"].mean(skipna=False)

np.float64(nan)

In [16]:
df[
    df["col1"].notna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [17]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [21]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [22]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [23]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [26]:
df.dropna(thresh=1)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [27]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [29]:
df["col2"].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [31]:
df["col2"] = df["col2"].fillna(0)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   0.0  NaN
3    NaN   0.0  NaN
4  test5   0.0  bbb
5    NaN   0.0  NaN

In [33]:
df["col1"].fillna(method="ffill")

/tmp/ipykernel_54886/2941000901.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["col1"].fillna(method="ffill")

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [34]:
df["col1"].ffill() #前補後

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [35]:
df["col1"].bfill() #後補前

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object